Repository: mickaelrei/drive-deal
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Register
pt: Registrar

source: Enter
pt: Entrar

source: Edit
pt: Editar

source: Yes
pt: Sim

source: No
pt: Não

source: Success
pt: Sucesso

source: Error
pt: Erro

# registerSuccess
source: Successfully registered
pt: Registrado com sucesso

# editSuccess
source: Successfully edited
pt: Editado com sucesso

source: Invalid login
pt: Login inválido

# reviewCredentials
source: Review your credentials
pt: Reveja seus dados

source: Loading
pt: Carregando

source: Register Autonomy Level
pt: Registrar Nível de Autonomia

source: Edit Autonomy Level
pt: Editar Nível de Autonomia

# autonomyLevel
source: {count, plural, =1{Autonomy Level} other{Autonomy Levels}}
pt: {count, plural, =1{Nível de Autonomia} other{Níveis de Autonomia}}

source: No Autonomy Levels
pt: Nenhum Nível de Autonomia

source: Register Partner Store
pt: Registrar Loja Parceira

source: Edit Partner Store
pt: Editar Loja Parceira

source: Partner Store Info
pt: Dados de Loja Parceira

# partnerStore
source: {count, plural, =1{Partner Store} other{Partner Stores}}
pt: {count, plural, =1{Loja Parceira} other{Lojas Parceiras}}

source: No Partner Stores
pt: Nenhuma Loja Parceira

source: Register Sale
pt: Registrar venda

source: Sale Info
pt: Dados de venda

# sale
source: {count, plural, =1{Sale} other{Sales}}
pt: {count, plural, =1{Venda} other{Vendas}}

source: No sales
pt: Nenhuma venda

source: Edit User
pt: Editar usuário

source: User Info
pt: Dados de usuário

# user
source: {count, plural, =1{User} other{Users}}
pt: {count, plural, =1{Usuário} other{Usuários}}

# vehicleImage
source: {count, plural, =1{Vehicle Image} other{Vehicle Images}}
pt: {count, plural, =1{Foto do veículo} other{Fotos do veículo}}

source: Register Vehicle
pt: Registar veículo

source: Edit Vehicle
pt: Editar veículo

source: Vehicle Info
pt: Dados do veículo

# vehicle
source: {count, plural, =1{Vehicle} other{Vehicles}}
pt: {count, plural, =1{Veículo} other{Veículos}}

source: No vehicles
pt: Nenhum veículo

source: Name or CNPJ
pt: Nome ou CNPJ

source: Password
pt: Senha

source: Home
pt: Início

source: Stores
pt: Lojas

source: Autonomy
pt: Autonomia

source: Settings
pt: Opções

source: Label
pt: Título

# labelNotEmpty
source: Label can't be empty
pt: Título não pode ser vazio

# labelMinSize
source: Label needs at least {count} characters
pt: Título precisa de no mínimo {count} caracteres

# saleStoreProfitRegister
source: Sale store profit (in %)
pt: Lucro da loja (em %)

# saleNetworkProfitRegister
source: Sale network profit (in %)
pt: Lucro da rede (em %)

source: Sale store profit
pt: Lucro da loja

source: Sale network profit
pt: Lucro da rede

# noAutonomyLevel
source: No Autonomy Level selected
pt: Nenhum Nível de Autonomia selecionado

source: Invalid CNPJ
pt: CNPJ inválido

# cnpjInUse
source: CNPJ already in use
pt: CNPJ já em uso

source: Name
pt: Nome

source: Store Name
pt: Nome da loja

# nameNotEmpty
source: Name can't be empty
pt: Nome não pode ser vazio

# nameMinSize
source: Name needs at least {count} characters
pt: Nome precisa de no mínimo {count} caracteres

# nameMaxSize
source: Name can be at max {count} characters long
pt: Título pode ter no máximo {count} caracteres

source: Registered vehicles
pt: Veículos registrados

source: Registered sales
pt: Vendas registradas

source: Brand
pt: Marca

source: Model
pt: Modelo

source: Model year
pt: Ano do modelo

source: FIPE Price
pt: Preço FIPE

source: Purchase Price
pt: Preço de compra

source: Manufacture Year
pt: Ano de fabricação

source: Plate
pt: Placa

source: Purchase Date
pt: Data de compra

source: Images
pt: Imagens

source: No images
pt: Nenhuma imagem

# imageLoadFailed
source: Failed to load image
pt: Falha ao carregar imagem

source: Sold yet
pt: Vendido

# chooseBrand
source: Choose a brand
pt: Escolha uma marca

# chooseModel
source: Choose a model
pt: Escolha um modelo

# chooseModelYear
source: Choose a model year
pt: Escolha o ano do modelo

# noVehicleInfo
source: Failed to retrieve vehicle info. Try again
pt: Falha ao carregar dados do veículo. Tente novamente

source: Invalid manufacture year
pt: Ano de fabricação inválido

# invalidPlate
source: Plate needs to be in AAA0A00 format
pt: A placa deve estar no formato AAA0A00

# choosePurchaseDate
source: Choose a purchase date
pt: Escolha a data de compra

source: Invalid purchase price
pt: Preço de compra inválido

# alreadySold
source: This vehicle was already sold. No permission to make edits on it
pt: Esse veículo já foi vendido. Sem permissões para fazer alterações

# loadingVehicleDataError
source: Error loading vehicle data. Try again later
pt: Erro ao carregar dados do veículo. Tente novamente

# chooseVehicle
source: Choose a vehicle
pt: Escolha um veículo

# chooseSaleDate
source: Choose the sale date
pt: Escolha a data da venda

# saleBeforePurchase
source: Sale date needs to be after vehicle purchase date
pt: Data de venda deve ser após data de compra do veículo

# invalidPrice
source: Price is in invalid format
pt: Preço em formato inválido

source: Date Interval
pt: Intervalo de datas

source: Customer
pt: Comprador

source: Customer name
pt: Nome do comprador

source: Customer CPF
pt: CPF do comprador

source: Sale Price
pt: Preço de venda

source: Sale Date
pt: Data de venda

source: Sold on
pt: Vendido em

source: Network Profit
pt: Lucro da rede

source: Store Profit
pt: Lucro da loja

source: Safety Profit
pt: Lucro do caixa de segurança

source: Total Price
pt: Preço total

source: User Name
pt: Nome de usuário

# userEditFailed
source: Failed to edit user. Name already in use
pt: Falha ao editar usuário. Nome já está em uso

source: Total Network Profit
pt: Lucro total para a rede

source: Total Store Profit
pt: Lucro total para a loja

source: Total Safety Profit
pt: Lucro total para o caixa de segurança

source: Dark Mode
pt: Modo Escuro

source: App Language
pt: Linguagem

source: English
pt: Inglês

source: Portuguese
pt: Português

# unknownPage
source: Error: Unknown page
pt: Erro: Página Desconhecida
